In [1]:
import pandas as pd                # DataFrame operation
import numpy as np                 # math operation
import matplotlib.pyplot as plt    # Ploting
import seaborn  as san            # Ploatting

In [2]:
name=['Ramesh','Suresh','Yogesh']
age=['20','22','21']
pd.DataFrame(zip(name,age))

        0   1
0  Ramesh  20
1  Suresh  22
2  Yogesh  21

In [3]:
data=None
index=
colum=

SyntaxError: invalid syntax (1738410136.py, line 2)

In [9]:
name=['Ramesh','Suresh','Yogesh']
age=['20','22','21']
pd.DataFrame(name,age)

         0
20  Ramesh
22  Suresh
21  Yogesh

**Step-3: Add a column name**

In [5]:
name=['Ramesh','Suresh','Mukesh']
age=['23','22','24']
colo=['name','age']
pd.DataFrame(zip(name,age),columns=colo)

     name age
0  Ramesh  23
1  Suresh  22
2  Mukesh  24

**Step-4: chainge the index**

In [7]:
name=['Ramesh','Suresh','Mukesh']
age=['23','22','24']
colo=['name','age']
indx=['A','B','C']
pd.DataFrame(zip(name,age), index=indx,columns=colo)

     name age
A  Ramesh  23
B  Suresh  22
C  Mukesh  24

**Step-4:Create a empty DataFrame and update the df**

In [9]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [34]:
df['Name']

KeyError: 'Name'

In [11]:
name=['Ramesh','Suresh','Mukesh']
age=['23','22','24']
df['Name']=name
df['Age']=age
df

     Name Age
0  Ramesh  23
1  Suresh  22
2  Mukesh  24

In [13]:
df['Name']=['Ramesh','Suresh','Mukesh']
df['Age']=['20','22','24']
df

     Name Age
0  Ramesh  20
1  Suresh  22
2  Mukesh  24

In [15]:
df['City']=['hydr','mubie','dhili']   # adding the colum
df

     Name Age   City
0  Ramesh  20   hydr
1  Suresh  22  mubie
2  Mukesh  24  dhili

In [17]:
df['Age']=[30,32,34]  # Updating
df['age']=[100,200,300]  #Creating
df['City']=['Hyd','Blr','Channai'] #Creating
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

**Nots**

- Python case sensitive

- 'Age' and 'age' cosider as different

- updating column value always should be len dataframe

- dont expected null value like SQL

- you have to provide all the value which needed

In [19]:
Step-6 - drop the column

leble:'IndexLable | None' = None
axis : 'Axis' = 0
Index:
Columns:
inplace: 'bool' = False

SyntaxError: invalid syntax (1657705269.py, line 1)

**Step-6: Drop the column**

leble :'IndexLable | None ' = None

axis : 'Axis'=0

Index:

Columns:

inplace: 'bool'  = False

In [49]:
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

In [53]:
df.drop(3)

KeyError: '[3] not found in axis'

In [21]:
df.drop([2])

     Name  Age City  age
0  Ramesh   30  Hyd  100
1  Suresh   32  Blr  200

In [23]:
df.drop(2,axis=0)

     Name  Age City  age
0  Ramesh   30  Hyd  100
1  Suresh   32  Blr  200

In [65]:
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

In [ ]:
df.rename

In [67]:
df.drop([])

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

In [69]:
df.drop(2,axis=1)

KeyError: '[2] not found in axis'

In [71]:
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

**To Drop the column**

In [25]:
df.drop(columns='age')

     Name  Age     City
0  Ramesh   30      Hyd
1  Suresh   32      Blr
2  Mukesh   34  Channai

**To drop the rows using index**

In [27]:
df.drop(index=2)

     Name  Age City  age
0  Ramesh   30  Hyd  100
1  Suresh   32  Blr  200

In [29]:
df.columns

Index(['Name', 'Age', 'City', 'age'], dtype='object')

In [31]:
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

In [33]:
df.drop(2) # works
df.drop(2,axis=0) #works
df.drop(2,axis=1) #works
df.drop('age',axis=1) #works
df.drop('')

KeyError: '[2] not found in axis'

In [ ]:
df.drop(2)   # works
df.drop(2,axis=0) # works
df.drop(2,axis=1) # works
df.drop('age',axis=1) # works
df.drop('')

In [88]:
df

     Name  Age     City  age
0  Ramesh   30      Hyd  100
1  Suresh   32      Blr  200
2  Mukesh   34  Channai  300

- Inplace=True

    - It will delete parmanatly

In [ ]:
df.drop(columns=['age'],
       inplace=True)

9

In [37]:
# assignment -1
df.rename()

TypeError: must pass an index to rename

In [ ]:
# assignment-2
# DataFrame is df
df.shape
df.size
df.drope_duplicates
df.select_dtypes
df.columns
dg.isnull
len(df)
df.info
df.dtypes

In [ ]:
# import the pakages 
# create a dataframe
# add our own index
# create a empty dataframe adn we update the

In [39]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,22,44]
df['City']=['hyd','Blr','pune']
df

     Names  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [41]:
df.drop(2)
df.drop(2,axis=0)
df.drop(index=2)
df.drop([1,2])
df.drop([1,2],axis=0)
df.drop(index=[1,2])

df.drop('City',axis=1)
df.drop(['Name','City'],axis=1)
df.drop(columns='City')
df.drop(columns=['Namws','City'])

KeyError: "['Name'] not found in axis"

Step-7:  Rename the  dictionry

  mapper: 'Renamer | None' = None,
  /
    *,
    index: 'Renamer | None' = None,
    
    columns: 'Renamer | None' = None,
    
    axis: 'Axis | None' = None,
    
    copy: 'bool | None' = None,
    
    inplace: 'bool' = False,

In [ ]:
df.rename

In [43]:
df.columns
dict1={'City':'city'}
# df.(dict1)  # this mapper for index or colum
df.rename(dict1,axis=1)

     Names  Age  city
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [45]:
df.rename(columns=dict1)

     Names  Age  city
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [11]:
df.(dict1)  # this mapper for index or colum

SyntaxError: invalid syntax (165327663.py, line 1)

In [47]:
df.index
dict1={2:'b'}
df.rename(dict1)

     Names  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
b  Sathish   44  pune

In [49]:
df.columns=['A','B','C']

In [17]:
df

         A   B     C
0   Ramesh  20   hyd
1   Suresh  22   Blr
2  Sathish  44  pune

In [51]:
df.index=[0,1,2]
df.columns=['Name','Age','City']
df

      Name  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [3]:
name=['Amol','ram','sham','jagnath']
city=['mumbai','dhili','gova','zarkhand']
age=[20,34,23,24]
dff=pd.DataFrame(zip(name,city,age))

In [5]:
dff

         0         1   2
0     Amol    mumbai  20
1      ram     dhili  34
2     sham      gova  23
3  jagnath  zarkhand  24

In [9]:
dff1=pd.DataFrame()
dff1['name']=['Amol','ram','sham','jagnath']
dff1['city']=['mumbai','dhili','gova','zarkhand']
dff1['age']=[20,34,23,24]
dff1

      name      city  age
0     Amol    mumbai   20
1      ram     dhili   34
2     sham      gova   23
3  jagnath  zarkhand   24

**Step-8: append the rows**

- we need to use **loc**

- df.loc[<orw number >,<column names>]

    - Example : df.loc[2,'City']

- Multiple rows from multiple columes

    Example : df.loc[[1,2],['Name','City']]

- df.loc[Start:stop:step,<Column names>]

    - Example : df.loc[0:3,'City']

In [24]:
df.loc[2,'City']

'pune'

In [26]:
df.loc[[1,2],['Name','City']]

      Name  City
1   Suresh   Blr
2  Sathish  pune

In [55]:
df.loc[0:3,'City']

0     hyd
1     Blr
2    pune
Name: City, dtype: object

In [ ]:
df.loc[2]  # 2nd index of all column
df.loc[[2]]   # 2nd index of all column
df.loc[[1,2]]    #df
df.loc[0:3]      # s
df.loc[:]         #s
df.loc[2,'City']  #s

In [34]:
print
type(df.loc[2])

pandas.core.series.Series

In [36]:
type(df.loc[[2]])

pandas.core.frame.DataFrame

In [ ]:
df.loc[2,['City']]  #s

In [ ]:
df.loc[[2],['City']]   #df

In [ ]:
df.loc[[1,2],['Name','City']]    #df

In [ ]:
df.loc[:,'City']   #s

In [ ]:
df.loc[:,['City']]   #df:[0,1,2]

In [30]:
df.loc[[2]]

      Name  Age  City
2  Sathish   44  pune

In [32]:
df.loc[2]

Name    Sathish
Age          44
City       pune
Name: 2, dtype: object

**iloc**

In [ ]:
df.loc[<rows>,<column names>]
df.loc[]

In [57]:
print(df.loc[2],'\n')# 2nd index of all column
print(type(df.loc[2]))

Name    Sathish
Age          44
City       pune
Name: 2, dtype: object
<class 'pandas.core.series.Series'>

In [59]:
print(df.loc[[2]],'\n')# 2nd index of all column
print(type(df.loc[[2]]))

      Name  Age  City
2  Sathish   44  pune

<class 'pandas.core.frame.DataFrame'>

In [101]:
print(df.loc[[1,2]],'\n')#df
print(type(df.loc[[1,2]]))

      Name  Age  City
1   Suresh   22   Blr
2  Sathish   44  pune

<class 'pandas.core.frame.DataFrame'>

In [99]:
print(df.loc[0:3],'\n') # s
print(type(df.loc[0:3]))

      Name  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

<class 'pandas.core.frame.DataFrame'>

In [97]:
print(df.loc[:],'\n')#s
print(type(df.loc[:]))

      Name  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

<class 'pandas.core.frame.DataFrame'>

In [95]:
print(df.loc[2,'City'],'\n')
print(type(df.loc[2,'City']))

pune

<class 'str'>

In [93]:
print(df.loc[2,['City']],'\n')
print(type(df.loc[2,['City']]))

City    pune
Name: 2, dtype: object

<class 'pandas.core.series.Series'>

In [91]:
print(df.loc[[2],['City']],'\n')
print(type(df.loc[[2],['City']]))

   City
2  pune

<class 'pandas.core.frame.DataFrame'>

In [89]:
print(df.loc[[1,2],['Name','City']],'\n' )
print(type(df.loc[[1,2],['Name','City']]))

      Name  City
1   Suresh   Blr
2  Sathish  pune

<class 'pandas.core.frame.DataFrame'>

In [87]:
print(df.loc[:,'City'],'\n')
print(type(df.loc[:,'City']))

0     hyd
1     Blr
2    pune
Name: City, dtype: object

<class 'pandas.core.series.Series'>

In [85]:
print(df.loc[:,['City']],'\n')
print(type(df.loc[:,['City']]))

   City
0   hyd
1   Blr
2  pune

<class 'pandas.core.frame.DataFrame'>

In [ ]:
print(df.loc[2])# 2nd index of all column
print(type(df.loc[2]))
print(df.loc[[2]])# 2nd index of all column
print(df.loc[[2]])
print(df.loc[[1,2]])#df
print(type(df.loc[[1,2]]))
print(df.loc[0:3]) # s
print(type(df.loc[0:3]))
print(df.loc[:])#s
print(type(df.loc[:]))
print(df.loc[2,'City'])
print(type(df.loc[2,'City']))
print(df.loc[2,['City']])
print(type(df.loc[2,['City']]))
print(df.loc[[2],['City']] )
print(type(df.loc[[2],['City']]))
print(df.loc[[1,2],['Name','City']] )
print(type(df.loc[[1,2],['Name','City']]))
print(df.loc[:,'City'])
print(type(df.loc[:,'City']))
print(df.loc[:,['City']])
print(df.loc[:,['City']])

In [ ]:
df.iloc[2]  # 2nd index of all column
df.iloc[[2]]   # 2nd index of all column
df.iloc[[1,2]]    #df
df.iloc[0:3]      # s
df.iloc[:]         #s
df.iloc[2,2]
df.iloc[2,[2]] 
df.iloc[[2],[2]] 
df.iloc[[1,2],[0,2]] 
df.iloc[:,2] 
df.iloc[:,[2]]

In [39]:
df.iloc[2]

Name    Sathish
Age          44
City       pune
Name: 2, dtype: object

In [41]:
df.iloc[[2]]

      Name  Age  City
2  Sathish   44  pune

In [43]:
df.iloc[[1,2]]

      Name  Age  City
1   Suresh   22   Blr
2  Sathish   44  pune

In [45]:
df.iloc[0:3]

      Name  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [47]:
df.iloc[:]

      Name  Age  City
0   Ramesh   20   hyd
1   Suresh   22   Blr
2  Sathish   44  pune

In [49]:
df.iloc[2,2]

'pune'

In [51]:
df.iloc[2,[2]]

City    pune
Name: 2, dtype: object

In [53]:
df.iloc[[2],[2]]

   City
2  pune

In [55]:
df.iloc[[1,2],[0,2]]

      Name  City
1   Suresh   Blr
2  Sathish  pune

In [63]:
p=df.iloc[:,2] 
c=type(df.iloc[:,2] )
print(p)
print(c)

0     hyd
1     Blr
2    pune
Name: City, dtype: object
<class 'pandas.core.series.Series'>

In [61]:
df.iloc[:,[2]] 
a=type(df.iloc[:,[2]])
a

pandas.core.frame.DataFrame

In [65]:
df.iloc[0:3,[2]]
df.iloc[[0,1,2],2]

0     hyd
1     Blr
2    pune
Name: City, dtype: object

**Step-9: Save the dataframe**

- where i want to save

- on what name i want to save

- on what extenstioin: .csv,.xlsx

In [117]:
# df.to_excel()
a=df.to_csv(r"C:\Users\amol\Downloads\Csv_File.csv",index=False)

**Step-10: Read the dataframe**

In [119]:
ass=pd.read_csv(a)
print(ass)

ValueError: Invalid file path or buffer object type: <class 'NoneType'>

In [ ]:

# above is one emty colume is add  but below line use to empty columns is automatic not give
df.to_csv(path1,index=False)
df.to_csv(path2,index=False)
df.to_excel(path1,index=False)
df.to_excel(path2,index=False)

In [121]:
import pandas as pd

# Create sample DataFrame
df = pd.DataFrame({
    'Name': ['Amol', 'Ravi', 'Neha'],
    'Marks': [85, 90, 95]
})

# Save to CSV (do not assign to variable)
df.to_csv(r"C:\Users\amol\Downloads\Csv_File.csv", index=False)

# Read from CSV using the correct file path
ass = pd.read_csv(r"C:\Users\amol\Downloads\Csv_File.csv")

print(ass)

   Name  Marks
0  Amol     85
1  Ravi     90
2  Neha     95